## 월평균임금 데이터 전처리

In [9]:
import pandas as pd

In [10]:
df = pd.read_excel('../data/월평균_임금.xlsx')

c:\Users\admin\AppData\Local\Programs\Python\Python310\lib\site-packages\openpyxl\styles\stylesheet.py:226: UserWarning: Workbook contains no default style, apply openpyxl's default
  warn("Workbook contains no default style, apply openpyxl's default")

In [11]:
df.columns

Index(['행정구역별(1)', '항목', '2011', '2012', '2013', '2014', '2015', '2016',
       '2017', '2018', '2019', '2020', '2021'],
      dtype='object')

In [12]:
df.head(2)

,행정구역별(1),항목,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020,2021
0,전국,상용 월평균 임금 (원),2487339,2619833,2736921,2838343,2926186,3030286,3125273,3259281,3405769,3447287,3581564
1,서울특별시,상용 월평균 임금 (원),2921496,3007110,3168798,3199814,3261561,3364470,3445867,3563940,3704202,3745761,3904436

### 전국 index제거

In [13]:
df.drop(index=0,inplace=True)
df.head(2)

,행정구역별(1),항목,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020,2021
1,서울특별시,상용 월평균 임금 (원),2921496,3007110,3168798,3199814,3261561,3364470,3445867,3563940,3704202,3745761,3904436
2,부산광역시,상용 월평균 임금 (원),2356022,2453216,2520222,2558970,2620611,2694140,2786616,2962069,3050186,3124238,3288414

### Melt

In [14]:
df = pd.melt(df,id_vars=['행정구역별(1)', '항목'],value_vars=['2011', '2012', '2013', '2014', '2015', '2016',
       '2017', '2018', '2019', '2020', '2021'],var_name='년도',value_name='소득')
df.head()

  행정구역별(1)             항목    년도       소득
0    서울특별시  상용 월평균 임금 (원)  2011  2921496
1    부산광역시  상용 월평균 임금 (원)  2011  2356022
2    대구광역시  상용 월평균 임금 (원)  2011  2165156
3    인천광역시  상용 월평균 임금 (원)  2011  2410840
4    광주광역시  상용 월평균 임금 (원)  2011  2226364

### 항목 컬럼 제거

In [15]:
df.drop(columns='항목',inplace=True)
df

    행정구역별(1)    년도       소득
0      서울특별시  2011  2921496
1      부산광역시  2011  2356022
2      대구광역시  2011  2165156
3      인천광역시  2011  2410840
4      광주광역시  2011  2226364
..       ...   ...      ...
182     전라북도  2021  3082279
183     전라남도  2021  3352080
184     경상북도  2021  3452111
185     경상남도  2021  3399502
186  제주특별자치도  2021  2906566

[187 rows x 3 columns]

### 컬럼명 변경

In [16]:
df.rename(columns={'행정구역별(1)':'행정구역'},inplace=True)
df

        행정구역    년도       소득
0      서울특별시  2011  2921496
1      부산광역시  2011  2356022
2      대구광역시  2011  2165156
3      인천광역시  2011  2410840
4      광주광역시  2011  2226364
..       ...   ...      ...
182     전라북도  2021  3082279
183     전라남도  2021  3352080
184     경상북도  2021  3452111
185     경상남도  2021  3399502
186  제주특별자치도  2021  2906566

[187 rows x 3 columns]

### nan값 처리

In [17]:
# pd.to_numeric(df['소득'],errors='coerce')
df.소득 = df.소득.replace(['-'],0)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 187 entries, 0 to 186
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   행정구역    187 non-null    object
 1   년도      187 non-null    object
 2   소득      187 non-null    int64
dtypes: int64(1), object(2)
memory usage: 4.5+ KB

In [18]:
df[df.행정구역=='세종특별자치시']

        행정구역    년도       소득
7    세종특별자치시  2011        0
24   세종특별자치시  2012        0
41   세종특별자치시  2013        0
58   세종특별자치시  2014        0
75   세종특별자치시  2015        0
92   세종특별자치시  2016        0
109  세종특별자치시  2017        0
126  세종특별자치시  2018        0
143  세종특별자치시  2019        0
160  세종특별자치시  2020  3423078
177  세종특별자치시  2021  3530820

### 원 -> 만원 단위변경

In [19]:
df.소득 = df.소득.astype(int)

In [20]:
df.소득 = df.소득//10000

In [21]:
df.head()

    행정구역    년도   소득
0  서울특별시  2011  292
1  부산광역시  2011  235
2  대구광역시  2011  216
3  인천광역시  2011  241
4  광주광역시  2011  222

### csv저장

In [22]:
df.to_csv('../data/월평균_임금_handling.csv',encoding='utf-8')